---
type: RepeatingReferenceSource
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# RepeatingReferenceSource

`Autodesk.Revit.DB.RepeatingReferenceSource` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBounds | 2014 | `public RepeaterBounds GetBounds ()` |
| Method | GetDefaultRepeatingReferenceSource | 2014 | `public static RepeatingReferenceSource GetDefaultRepeatingReferenceSource ( Document document , ElementId elementId )` |
| Method | GetReference | 2014 | `public Reference GetReference ( RepeaterCoordinates coordinates )` |
| Method | HasRepeatingReferenceSource | 2014 | `public static bool HasRepeatingReferenceSource ( Document document , ElementId elementId )` |
| Property | DimensionCount | 2014 | `public int DimensionCount { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |